krishiv2489/RoboFest-6.0-IGVC/STM32cubeMX/src/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

#include "stm32f4xx_nucleo.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define M1_DIR_Pin GPIO_PIN_0
#define M1_DIR_GPIO_Port GPIOC
#define M2_DIR_Pin GPIO_PIN_1
#define M2_DIR_GPIO_Port GPIOC
#define M3_DIR_Pin GPIO_PIN_2
#define M3_DIR_GPIO_Port GPIOC
#define M4_DIR_Pin GPIO_PIN_3
#define M4_DIR_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define TOF1_XSHUT_Pin GPIO_PIN_4
#define TOF1_XSHUT_GPIO_Port GPIOC
#define TOF2_XSHUT_Pin GPIO_PIN_5
#define TOF2_XSHUT_GPIO_Port GPIOC
#define TOF3_XSHUT_Pin GPIO_PIN_0
#define TOF3_XSHUT_GPIO_Port GPIOB
#define TOF4_XSHUT_Pin GPIO_PIN_1
#define TOF4_XSHUT_GPIO_Port GPIOB
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define ESTOP_SENSE_Pin GPIO_PIN_10
#define ESTOP_SENSE_GPIO_Port GPIOC
#define ESTOP_SENSE_EXTI_IRQn EXTI15_10_IRQn
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
